app/controllers/assets_controller.rb

SELECT * FROM "assets" ORDER BY created_at ASC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "assets"
---
  def index

    @assets = Asset.paginate  :page => params[:page], :order => 'created_at ASC'

SELECT * FROM "assets" WHERE ("assets"."id" = 1)
---
  def show
    @asset = Asset.find(params[:id])

INSERT INTO "assets" ("Order_Date", "created_at", "Request_Number", "Location", "updated_at", "Purchase_Order_Number", "Description") VALUES('2006-07-01', '2011-02-09 08:09:23', 1, '?', '2011-02-09 08:09:23', 'POENG02019', 'INDUCTION MOTOR
---
  def create
    @asset = Asset.new(params[:asset])
    if @asset.save

SELECT * FROM "assets" WHERE ("assets"."id" = 1)
---
  def edit
    @asset = Asset.find(params[:id])

SELECT * FROM "assets" WHERE ("assets"."id" = 1)
UPDATE "assets" SET "updated_at" = '2011-02-08 18:08:55', "Location" = 'R526', "Request_Number" = 30664, "Purchase_Order_Number" = 'POAAA04379', "Order_Date" = '2006-06-19', "Description" = 'AS LISTED' WHERE "id" = 1
---
  def update
    @asset = Asset.find(params[:id])
    if @asset.update_attributes(params[:asset])