app/controllers/users_controller.rb

  def create
    @users = Users.new(params[:users])
    if @users.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2011-02-08 19:49:28', '2011-02-08 19:49:28', 'test', '4c5142482c9ccad76f6330df8ecbddcc8de1c6fb', 'dc3ee6745b22ed50106c2833984ac8dda051389f', 'test@test.com')